Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingCalculationNoneWarn
Some elements are not sized because the system calculation is none. You may change the system calculation level to size them again.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.DuctPipeOpositDirection
The duct/pipe has been modified to be in the opposite direction causing the connections to be invalid.